garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:SFRDef edc:access="nrnn--nn" edc:cname="FVRCON" edc:desc="Voltage Reference Control Register 0" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0q00--00" edc:name="FVRCON" edc:nzwidth="8" edc:por="0q00--00" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Temperature Sensor Range Select" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Sensor Enable" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="Fixed Voltage Reference Ready Flag" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="Fixed Voltage Reference Enable" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x118"/>
        <edc:SFRDef edc:access="--n---nn" edc:cname="APFCON" edc:desc="Alternate Pin Function Control Register" edc:impl="0x23" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0---00" edc:name="APFCON" edc:nzwidth="8" edc:por="--0---00" edc:_addr="0x11D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GRDASEL" edc:desc="" edc:mask="0x1" edc:name="GRDASEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDBSEL" edc:desc="" edc:mask="0x1" edc:name="GRDBSEL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SSSEL" edc:desc="" edc:mask="0x1" edc:name="SSSEL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x11E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA6" edc:mask="0x1" edc:name="ANSA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA7" edc:mask="0x1" edc:name="ANSA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0xff" edc:name="ANSELA" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELB" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x18D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSB0" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB1" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB2" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB3" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB6" edc:desc="" edc:mask="0x1" edc:name="ANSB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB7" edc:desc="" edc:mask="0x1" edc:name="ANSB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELB" edc:desc="" edc:mask="0xff" edc:name="ANSELB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x18E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSC0" edc:desc="" edc:mask="0x1" edc:name="ANSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC1" edc:desc="" edc:mask="0x1" edc:name="ANSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC4" edc:desc="" edc:mask="0x1" edc:name="ANSC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC5" edc:desc="" edc:mask="0x1" edc:name="ANSC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC6" edc:desc="" edc:mask="0x1" edc:name="ANSC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC7" edc:desc="" edc:mask="0x1" edc:name="ANSC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELC" edc:desc="" edc:mask="0xff" edc:name="ANSELC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELD" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x18F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSD0" edc:desc="" edc:mask="0x1" edc:name="ANSD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD1" edc:desc="" edc:mask="0x1" edc:name="ANSD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD2" edc:desc="" edc:mask="0x1" edc:name="ANSD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD3" edc:desc="" edc:mask="0x1" edc:name="ANSD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD4" edc:desc="" edc:mask="0x1" edc:name="ANSD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD5" edc:desc="" edc:mask="0x1" edc:name="ANSD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD6" edc:desc="" edc:mask="0x1" edc:name="ANSD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD7" edc:desc="" edc:mask="0x1" edc:name="ANSD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELD" edc:desc="" edc:mask="0xff" edc:name="ANSELD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELE" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x190">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSE0" edc:desc="" edc:mask="0x1" edc:name="ANSE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE1" edc:desc="" edc:mask="0x1" edc:name="ANSE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE2" edc:desc="" edc:mask="0x1" edc:name="ANSE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELE" edc:desc="" edc:mask="0xff" edc:name="ANSELE" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
