garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:JoinedSFRDef edc:cname="SPBRG" edc:desc="" edc:name="SPBRG" edc:nzwidth="0x10" edc:_addr="0x19B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="SPBRGL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x19B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPBRGL" edc:desc="" edc:mask="0xff" edc:name="SPBRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="SPBRGH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x19C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPBRGH" edc:desc="" edc:mask="0xff" edc:name="SPBRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA" edc:nzwidth="8" edc:por="0000000x" edc:_addr="0x19D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA" edc:desc="Transmit Status and Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TXSTA" edc:nzwidth="8" edc:por="00000010" edc:_addr="0x19E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rr-nn-nn" edc:cname="BAUDCON" edc:desc="Baud Rate Control Register" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01-00-00" edc:name="BAUDCON" edc:nzwidth="8" edc:por="01-00-00" edc:_addr="0x19F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="4" edc:beginaddr="0x200" edc:endaddr="0x220" edc:regionid="sfr4">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x200"/>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x20C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="WPUB" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x20D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUB0" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB1" edc:mask="0x1" edc:name="WPUB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB2" edc:mask="0x1" edc:name="WPUB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB3" edc:mask="0x1" edc:name="WPUB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:desc="" edc:mask="0x1" edc:name="WPUB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:desc="" edc:mask="0x1" edc:name="WPUB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:desc="" edc:mask="0x1" edc:name="WPUB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:desc="" edc:mask="0x1" edc:name="WPUB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WPUB" edc:desc="" edc:mask="0xff" edc:name="WPUB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x20E"/>
        <edc:SFRDef edc:access="----n---" edc:cname="WPUE" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1---" edc:name="WPUE" edc:nzwidth="8" edc:por="----1---" edc:_addr="0x210">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="WPUE3" edc:mask="0x1" edc:name="WPUE3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WPUE" edc:desc="" edc:mask="0xff" edc:name="WPUE" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP1BUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x211">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPBUF"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1BUF0" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF1" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF2" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF3" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF4" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF5" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF6" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF7" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xff" edc:name="BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BUF0" edc:desc="" edc:mask="0x1" edc:name="BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF1" edc:desc="" edc:mask="0x1" edc:name="BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF2" edc:desc="" edc:mask="0x1" edc:name="BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF3" edc:desc="" edc:mask="0x1" edc:name="BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF4" edc:desc="" edc:mask="0x1" edc:name="BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF5" edc:desc="" edc:mask="0x1" edc:name="BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF6" edc:desc="" edc:mask="0x1" edc:name="BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF7" edc:desc="" edc:mask="0x1" edc:name="BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1BUF" edc:desc="" edc:mask="0xff" edc:name="SSP1BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1ADD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x212">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPADD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1ADD0" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD1" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD2" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD3" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD4" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD5" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD6" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD7" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADD" edc:desc="" edc:mask="0xff" edc:name="ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADD0" edc:desc="" edc:mask="0x1" edc:name="ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD1" edc:desc="" edc:mask="0x1" edc:name="ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD2" edc:desc="" edc:mask="0x1" edc:name="ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD3" edc:desc="" edc:mask="0x1" edc:name="ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD4" edc:desc="" edc:mask="0x1" edc:name="ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD5" edc:desc="" edc:mask="0x1" edc:name="ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD6" edc:desc="" edc:mask="0x1" edc:name="ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD7" edc:desc="" edc:mask="0x1" edc:name="ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1ADD" edc:desc="" edc:mask="0xff" edc:name="SSP1ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1MSK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SSP1MSK" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x213">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPMSK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1MSK0" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK1" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK2" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK3" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK4" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK5" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK6" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK7" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MSK" edc:desc="" edc:mask="0xff" edc:name="MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1MSK" edc:desc="" edc:mask="0xff" edc:name="SSP1MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP1STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1STAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x214">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPSTAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
