garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x215">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPCON"/>
            <edc:LegacyAlias edc:cname="SSPCON1"/>
            <edc:LegacyAlias edc:cname="SSP1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPM" edc:desc="" edc:mask="0xf" edc:name="SSPM" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPEN" edc:desc="" edc:mask="0x1" edc:name="SSPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPOV" edc:desc="" edc:mask="0x1" edc:name="SSPOV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="" edc:mask="0x1" edc:name="WCOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPM0" edc:desc="" edc:mask="0x1" edc:name="SSPM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM1" edc:desc="" edc:mask="0x1" edc:name="SSPM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM2" edc:desc="" edc:mask="0x1" edc:name="SSPM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM3" edc:desc="" edc:mask="0x1" edc:name="SSPM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="SSP1CON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x216">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="SSP1CON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x217">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPCON3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n---n" edc:cname="SSPLVL" edc:desc="" edc:impl="0x11" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0---0" edc:name="SSPLVL" edc:nzwidth="8" edc:por="---0---0" edc:_addr="0x218">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1ILS" edc:mask="0x1" edc:name="S1ILS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="S2ILS" edc:mask="0x1" edc:name="S2ILS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP2BUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x219">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2BUF0" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF1" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF2" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF3" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF4" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF5" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF6" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2BUF7" edc:desc="" edc:mask="0x1" edc:name="SSP2BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xff" edc:name="BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BUF0" edc:desc="" edc:mask="0x1" edc:name="BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF1" edc:desc="" edc:mask="0x1" edc:name="BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF2" edc:desc="" edc:mask="0x1" edc:name="BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF3" edc:desc="" edc:mask="0x1" edc:name="BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF4" edc:desc="" edc:mask="0x1" edc:name="BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF5" edc:desc="" edc:mask="0x1" edc:name="BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF6" edc:desc="" edc:mask="0x1" edc:name="BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF7" edc:desc="" edc:mask="0x1" edc:name="BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP2BUF" edc:desc="" edc:mask="0xff" edc:name="SSP2BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2ADD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x21A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2ADD0" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD1" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD2" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD3" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD4" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD5" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD6" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2ADD7" edc:desc="" edc:mask="0x1" edc:name="SSP2ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADD" edc:desc="" edc:mask="0xff" edc:name="ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADD0" edc:desc="" edc:mask="0x1" edc:name="ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD1" edc:desc="" edc:mask="0x1" edc:name="ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD2" edc:desc="" edc:mask="0x1" edc:name="ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD3" edc:desc="" edc:mask="0x1" edc:name="ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD4" edc:desc="" edc:mask="0x1" edc:name="ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD5" edc:desc="" edc:mask="0x1" edc:name="ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD6" edc:desc="" edc:mask="0x1" edc:name="ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD7" edc:desc="" edc:mask="0x1" edc:name="ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP2ADD" edc:desc="" edc:mask="0xff" edc:name="SSP2ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2MSK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SSP2MSK" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x21B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2MSK0" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK1" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK2" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK3" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK4" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK5" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK6" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MSK7" edc:desc="" edc:mask="0x1" edc:name="SSP2MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MSK" edc:desc="" edc:mask="0xff" edc:name="MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP2MSK" edc:desc="" edc:mask="0xff" edc:name="SSP2MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP2STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2STAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x21C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
