garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x480"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x60C"/>
        <edc:SFRDef edc:access="nn------" edc:cname="PWM1DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM1DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x611">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCL" edc:desc="" edc:mask="0x3" edc:name="PWM1DCL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x612">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1DCH" edc:desc="" edc:mask="0xff" edc:name="PWM1DCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM1DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM1CON" edc:desc="Configurable logic cell control" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x0----" edc:name="PWM1CON" edc:nzwidth="8" edc:por="00x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x613">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM1POL" edc:desc="" edc:mask="0x1" edc:name="PWM1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OUT" edc:desc="" edc:mask="0x1" edc:name="PWM1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE" edc:desc="" edc:mask="0x1" edc:name="PWM1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1EN" edc:desc="" edc:mask="0x1" edc:name="PWM1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="PWM2DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM2DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL" edc:desc="" edc:mask="0x3" edc:name="PWM2DCL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x615">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2DCH" edc:desc="" edc:mask="0xff" edc:name="PWM2DCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
