garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM2CON" edc:desc="Configurable logic cell control" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x0----" edc:name="PWM2CON" edc:nzwidth="8" edc:por="00x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x616">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2POL" edc:desc="" edc:mask="0x1" edc:name="PWM2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OUT" edc:desc="" edc:mask="0x1" edc:name="PWM2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE" edc:desc="" edc:mask="0x1" edc:name="PWM2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2EN" edc:desc="" edc:mask="0x1" edc:name="PWM2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0x617"/>
        <edc:SFRDef edc:access="-----n-n" edc:cname="PWMTMRS" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0-0" edc:name="PWMTMRS" edc:nzwidth="8" edc:por="-----0-0" edc:_addr="0x61D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1TSEL" edc:mask="0x1" edc:name="P1TSEL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="P2TSEL" edc:mask="0x1" edc:name="P2TSEL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM1AOE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM1AOE" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x61E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1OE" edc:mask="0xf" edc:name="PWM1OE" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM1OE0" edc:mask="0x1" edc:name="PWM1OE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE1" edc:mask="0x1" edc:name="PWM1OE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE2" edc:mask="0x1" edc:name="PWM1OE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE3" edc:mask="0x1" edc:name="PWM1OE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM2AOE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM2AOE" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x61F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2OE" edc:mask="0xf" edc:name="PWM2OE" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2OE0" edc:mask="0x1" edc:name="PWM2OE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE1" edc:mask="0x1" edc:name="PWM2OE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE2" edc:mask="0x1" edc:name="PWM2OE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE3" edc:mask="0x1" edc:name="PWM2OE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="ADCTX" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuu-uuu" edc:name="ADCTX" edc:nzwidth="8" edc:por="-xxx-xxx" edc:_addr="0x691">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="A1TX0" edc:mask="0x1" edc:name="A1TX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A1TX1" edc:mask="0x1" edc:name="A1TX1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A1TX2" edc:mask="0x1" edc:name="A1TX2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="A2TX0" edc:mask="0x1" edc:name="A2TX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A2TX1" edc:mask="0x1" edc:name="A2TX1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A2TX2" edc:mask="0x1" edc:name="A2TX2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AD1TX" edc:desc="" edc:name="AD1TX" edc:nzwidth="0x10" edc:_addr="0x692">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD1TX"/>
          </edc:AliasList>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD1TX0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AD1TX0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x692">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD1TX0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX10" edc:mask="0x1" edc:name="TX10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX11" edc:mask="0x1" edc:name="TX11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX12" edc:mask="0x1" edc:name="TX12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX13" edc:mask="0x1" edc:name="TX13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX14" edc:mask="0x1" edc:name="TX14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX15" edc:mask="0x1" edc:name="TX15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX16" edc:mask="0x1" edc:name="TX16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX17" edc:mask="0x1" edc:name="TX17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD1TX1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AD1TX1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x693">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD1TX1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX18" edc:mask="0x1" edc:name="TX18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX19" edc:mask="0x1" edc:name="TX19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX30" edc:mask="0x1" edc:name="TX30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX31" edc:mask="0x1" edc:name="TX31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX32" edc:mask="0x1" edc:name="TX32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX33" edc:mask="0x1" edc:name="TX33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX34" edc:mask="0x1" edc:name="TX34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX35" edc:mask="0x1" edc:name="TX35" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
