garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:JoinedSFRDef edc:cname="AD2TX" edc:desc="" edc:name="AD2TX" edc:nzwidth="0x10" edc:_addr="0x694">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2TX"/>
          </edc:AliasList>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD2TX0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AD2TX0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x694">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2TX0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX20" edc:mask="0x1" edc:name="TX20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX21" edc:mask="0x1" edc:name="TX21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX22" edc:mask="0x1" edc:name="TX22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX23" edc:mask="0x1" edc:name="TX23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX24" edc:mask="0x1" edc:name="TX24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX25" edc:mask="0x1" edc:name="TX25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX26" edc:mask="0x1" edc:name="TX26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX27" edc:mask="0x1" edc:name="TX27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD2TX1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AD2TX1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x695">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2TX1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX28" edc:mask="0x1" edc:name="TX28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX29" edc:mask="0x1" edc:name="TX29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX40" edc:mask="0x1" edc:name="TX40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX41" edc:mask="0x1" edc:name="TX41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX42" edc:mask="0x1" edc:name="TX42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX43" edc:mask="0x1" edc:name="TX43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX44" edc:mask="0x1" edc:name="TX44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX45" edc:mask="0x1" edc:name="TX45" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x70C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD1CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AD1CON0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x711">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON0"/>
            <edc:LegacyAlias edc:cname="AAD1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3f" edc:name="CHS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AD1ON" edc:mask="0x1" edc:name="AD1ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS5" edc:mask="0x1" edc:name="CHS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE1" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCOMCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCOMCON" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x712">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:desc="" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE_ALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:desc="" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:desc="" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_ALL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
