garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD1CH1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AD1CH1" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x71F">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AAD1CH1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CH18" edc:desc="" edc:mask="0x1" edc:name="CH18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH19" edc:desc="" edc:mask="0x1" edc:name="CH19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH30" edc:desc="" edc:mask="0x1" edc:name="CH30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH31" edc:desc="" edc:mask="0x1" edc:name="CH31" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH32" edc:desc="" edc:mask="0x1" edc:name="CH32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH33" edc:desc="" edc:mask="0x1" edc:name="CH33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH34" edc:desc="" edc:mask="0x1" edc:name="CH34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH35" edc:mask="0x1" edc:name="CH35" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x78C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD2CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AD2CON0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x791">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3f" edc:name="CHS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AD2ON" edc:mask="0x1" edc:name="AD2ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS5" edc:mask="0x1" edc:name="CHS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE2" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x792"/>
        <edc:SFRDef edc:access="-nnn----" edc:cname="AD2CON2" edc:desc="" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000----" edc:name="AD2CON2" edc:nzwidth="8" edc:por="-000----" edc:_addr="0x793">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:desc="" edc:mask="0x7" edc:name="TRIGSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL0" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL1" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL2" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="AD2CON3" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="AD2CON3" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x794">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CON3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD2DSEN" edc:desc="" edc:mask="0x1" edc:name="AD2DSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD2IPEN" edc:desc="" edc:mask="0x1" edc:name="AD2IPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="AD2IPPOL" edc:desc="" edc:mask="0x1" edc:name="AD2IPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD2EPPOL" edc:desc="" edc:mask="0x1" edc:name="AD2EPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:desc="" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADIPPOL" edc:desc="" edc:mask="0x1" edc:name="ADIPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADEPPOL" edc:desc="" edc:mask="0x1" edc:name="ADEPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x795"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD2PRECON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD2PRECON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x796">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD2PRE"/>
            <edc:LegacyAlias edc:cname="AAD2PRE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPRE" edc:desc="" edc:mask="0x7f" edc:name="ADPRE" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPRE0" edc:desc="" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE1" edc:desc="" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE2" edc:desc="" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE3" edc:desc="" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE4" edc:desc="" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE5" edc:desc="" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE6" edc:desc="" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD2ACQCON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD2ACQCON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x797">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD2ACQ"/>
            <edc:LegacyAlias edc:cname="AAD2ACQ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACQ" edc:desc="" edc:mask="0x7f" edc:name="ADACQ" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACQ0" edc:desc="" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ1" edc:desc="" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ2" edc:desc="" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ3" edc:desc="" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ4" edc:desc="" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ5" edc:desc="" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ6" edc:desc="" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="AD2GRD" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----u" edc:name="AD2GRD" edc:nzwidth="8" edc:por="000----x" edc:_addr="0x798">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2GRD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX2POL" edc:mask="0x1" edc:name="TX2POL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="GRD2POL" edc:desc="" edc:mask="0x1" edc:name="GRD2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD2AOE" edc:desc="" edc:mask="0x1" edc:name="GRD2AOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD2BOE" edc:desc="" edc:mask="0x1" edc:name="GRD2BOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXPOL" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="GRDPOL" edc:desc="" edc:mask="0x1" edc:name="GRDPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDAOE" edc:desc="" edc:mask="0x1" edc:name="GRDAOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDBOE" edc:desc="" edc:mask="0x1" edc:name="GRDBOE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
