garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1567.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="BSR_SHAD" edc:nzwidth="8" edc:por="---xxxxx" edc:_addr="0xFE6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_SHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_SHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="PCLATH_SHAD" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0xFE7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH_SHAD" edc:desc="" edc:mask="0x7f" edc:name="PCLATH_SHAD" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xFEC"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="STKPTR" edc:desc="Current Stack pointer" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="STKPTR" edc:nzwidth="8" edc:por="---11111" edc:_addr="0xFED">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0x1f" edc:name="STKPTR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="Top of Stack Low byte" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TOSL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="TOSH" edc:desc="Top of Stack High byte" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="TOSH" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0xFEF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:mask="0x7f" edc:name="TOSH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobank"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xF0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1A0" edc:endaddr="0x1F0" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="gpr3s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x220" edc:endaddr="0x270" edc:regionid="gpr4"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x270" edc:endaddr="0x280" edc:regionid="gpr4s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x2A0" edc:endaddr="0x2F0" edc:regionid="gpr5"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x2F0" edc:endaddr="0x300" edc:regionid="gpr5s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x320" edc:endaddr="0x370" edc:regionid="gpr6"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x370" edc:endaddr="0x380" edc:regionid="gpr6s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3A0" edc:endaddr="0x3F0" edc:regionid="gpr7"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3F0" edc:endaddr="0x400" edc:regionid="gpr7s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x420" edc:endaddr="0x470" edc:regionid="gpr8"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x470" edc:endaddr="0x480" edc:regionid="gpr8s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4A0" edc:endaddr="0x4F0" edc:regionid="gpr9"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4F0" edc:endaddr="0x500" edc:regionid="gpr9s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x520" edc:endaddr="0x570" edc:regionid="gpr10"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x570" edc:endaddr="0x580" edc:regionid="gpr10s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5A0" edc:endaddr="0x5F0" edc:regionid="gpr11"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5F0" edc:endaddr="0x600" edc:regionid="gpr11s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x620" edc:endaddr="0x650" edc:regionid="gpr12"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x670" edc:endaddr="0x680" edc:regionid="gpr12s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="13" edc:beginaddr="0x6F0" edc:endaddr="0x700" edc:regionid="gpr13s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="14" edc:beginaddr="0x770" edc:endaddr="0x780" edc:regionid="gpr14s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="15" edc:beginaddr="0x7F0" edc:endaddr="0x800" edc:regionid="gpr15s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="16" edc:beginaddr="0x870" edc:endaddr="0x880" edc:regionid="gpr16s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="17" edc:beginaddr="0x8F0" edc:endaddr="0x900" edc:regionid="gpr17s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="18" edc:beginaddr="0x970" edc:endaddr="0x980" edc:regionid="gpr18s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="19" edc:beginaddr="0x9F0" edc:endaddr="0xA00" edc:regionid="gpr19s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="20" edc:beginaddr="0xA70" edc:endaddr="0xA80" edc:regionid="gpr20s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="21" edc:beginaddr="0xAF0" edc:endaddr="0xB00" edc:regionid="gpr21s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="22" edc:beginaddr="0xB70" edc:endaddr="0xB80" edc:regionid="gpr22s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="23" edc:beginaddr="0xBF0" edc:endaddr="0xC00" edc:regionid="gpr23s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="24" edc:beginaddr="0xC70" edc:endaddr="0xC80" edc:regionid="gpr24s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="25" edc:beginaddr="0xCF0" edc:endaddr="0xD00" edc:regionid="gpr25s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="26" edc:beginaddr="0xD70" edc:endaddr="0xD80" edc:regionid="gpr26s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="27" edc:beginaddr="0xDF0" edc:endaddr="0xE00" edc:regionid="gpr27s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="28" edc:beginaddr="0xE70" edc:endaddr="0xE80" edc:regionid="gpr28s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="29" edc:beginaddr="0xEF0" edc:endaddr="0xF00" edc:regionid="gpr29s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="30" edc:beginaddr="0xF70" edc:endaddr="0xF80" edc:regionid="gpr30s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="31" edc:beginaddr="0xFF0" edc:endaddr="0x1000" edc:regionid="gpr31s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:EmulatorZone edc:beginaddr="0xF8C" edc:endaddr="0xF9F" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:IndirectSpace>
    <edc:LinearDataSector edc:banksize="0x80" edc:beginaddr="0x2000" edc:blockbeginaddr="0x20" edc:blockendaddr="0x70" edc:endaddr="0x29B0"/>
  </edc:IndirectSpace>
  <edc:PinList edc:desc="40-pin PDIP" edc:ppsflavor="simple">
    <edc:Pin>
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="ICDMCLR"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="VPP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="ADTX20"/>
      <edc:VirtualPin edc:name="PWM10"/>
      <edc:VirtualPin edc:name="SS1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AN20"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="ADTX10"/>
      <edc:VirtualPin edc:name="PWM11"/>
      <edc:VirtualPin edc:name="SS2"/>
      <edc:VirtualPin edc:name="AN10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="ADTX0"/>
      <edc:VirtualPin edc:name="PWM12"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="VREFMINUS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="ADTX1"/>
      <edc:VirtualPin edc:name="PWM13"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREFPLUS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="ADTX2"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="ADTX21"/>
      <edc:VirtualPin edc:name="SS1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN21"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="ADTX30"/>
      <edc:VirtualPin edc:name="AN30"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="ADTX41"/>
      <edc:VirtualPin edc:name="AN41"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="ADTX31"/>
      <edc:VirtualPin edc:name="AN31"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="ADTX11"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="ADTX22"/>
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="ADTX12"/>
      <edc:VirtualPin edc:name="SDO2"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="ADTX23"/>
      <edc:VirtualPin edc:name="PWM2"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="AN23"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="ADTX13"/>
      <edc:VirtualPin edc:name="PWM1"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="ADTX24"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="AN24"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="ADTX42"/>
      <edc:VirtualPin edc:name="AN42"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="ADTX32"/>
      <edc:VirtualPin edc:name="AN32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="ADTX43"/>
      <edc:VirtualPin edc:name="AN43"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="ADTX33"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="ADTX14"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="ADTX25"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="AN25"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="ADTX15"/>
      <edc:VirtualPin edc:name="TX"/>
      <edc:VirtualPin edc:name="CK"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="ADTX26"/>
      <edc:VirtualPin edc:name="RX"/>
      <edc:VirtualPin edc:name="DT"/>
      <edc:VirtualPin edc:name="AN26"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="ADTX34"/>
      <edc:VirtualPin edc:name="AN34"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="ADTX44"/>
      <edc:VirtualPin edc:name="AN44"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="ADTX35"/>
      <edc:VirtualPin edc:name="AN35"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="ADTX45"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="IOCB0"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="ADTX16"/>
      <edc:VirtualPin edc:name="PWM20"/>
      <edc:VirtualPin edc:name="AN16"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="IOCB1"/>
      <edc:VirtualPin edc:name="ADTX27"/>
      <edc:VirtualPin edc:name="PWM21"/>
      <edc:VirtualPin edc:name="AN27"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="IOCB2"/>
      <edc:VirtualPin edc:name="ADTX17"/>
      <edc:VirtualPin edc:name="PWM22"/>
      <edc:VirtualPin edc:name="AN17"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="IOCB3"/>
      <edc:VirtualPin edc:name="ADTX28"/>
      <edc:VirtualPin edc:name="PWM23"/>
      <edc:VirtualPin edc:name="AN28"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="IOCB4"/>
      <edc:VirtualPin edc:name="ADTX18"/>
      <edc:VirtualPin edc:name="AD2GRDA" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AD1GRDA" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN18"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="IOCB5"/>
      <edc:VirtualPin edc:name="ADTX29"/>
      <edc:VirtualPin edc:name="T1G"/>
      <edc:VirtualPin edc:name="AD2GRDA" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AD1GRDA" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AN29"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="IOCB6"/>
      <edc:VirtualPin edc:name="ADTX19"/>
      <edc:VirtualPin edc:name="AD2GRDB" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AD1GRDB" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="ICDCLK"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="IOCB7"/>
      <edc:VirtualPin edc:name="ADTX40"/>
      <edc:VirtualPin edc:name="AD2GRDB" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AD1GRDB" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AN40"/>
      <edc:VirtualPin edc:name="ICDDAT"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
